package Practice52;
/*Без двух нулей
Даны числа a и b. Определите, сколько существует последовательностей
из a нулей и b единиц, в которых никакие два нуля не стоят рядом. */
/*В комбинаторике сочетанием из n по k называется набор из k элементов,
выбранных из n -элементного множества, в котором не учитывается порядок элементов.
n =  2(0,1)*/
/*
Перестановками называются такие выборки элементов, которые отличаются только порядком расположения элементов,
 но не самими элементами. Если перестановки производятся на множестве из n элементов, их число определяется по формуле
Pn = n·(n−1)·(n−2)...3·2·1 = n!
*/
